# 1)კომენტარის სახით ახსენით რა არის ცვლადი

# 2)შექმენი ცვლადი სადაც შეინახავ შენი საყვარელი ფილმის სახელს, დაარქვი შესაბამისი სახელი

# 3)გამოიტანე ამ ცვლადის მნიშვნელობა

# 4)შექმენი ორი ცვლადი სადაც შეინახავ სტრინგებს, მოახდინე მათ შორის კონკატინაცია

# 5)დაპრინტე შენი სახელი 10-ჯერ

# 6)შექმენი სამი ცვლადი სადაც შეინახავ სამივე მონაცემთა ტიპს 

# 7)შექმენი ცვლადი სადაც შეინახავ რაიმე სტრინგს, განაახლე მისი მნიშვნელობა და შეინახე რაიმე ინტეჯერი


#1   ცვლადი არის ცვლადი  არის სახელი, რომელსაც ვაძლევთ მონაცემს, რომ შემდეგში მარტივად გამოვიყენოთ.

#2 
film="bad boys"
print(film)

#4
water="baxmaro"
name="saba"
print(water+name)

#5 

print("saba"*10)

#6



#string
name="nika"
print(name)

#int
number=8
print(number)

#float
ricxvi=2.8
print(ricxvi)

#7

book="saba"
book=7
print(book)

