# 1) კომენტარის სახით ახსენით რა არის ცვლადის მნიშვნელობის განახლება

# 2) შექმენი ცვლადი სადაც შეინახავ შენ ასაკს

# 3)შექმენი სამი ცვლადი სადაც შეინახავ ინფორმაციას შენ შესახებ (მაგ, name, age, height)  და შემდეგ კონკატინაციით ააწყე ერთი წინადადება

# 4)შექმენი ორი ცვლადი სადაც შეინახავ ინტეჯერებს, დაპრინტე მათი ჯამი

# 5) შექმენი ცვლადი სადაც შეინახავ ინტეჯერის სახით წინა გაკვეთილის ლეველს განაახლე მისი მნიშვნელობა და შეინახე დღევანდელი გაკვეთილის ლეველი

# 1

#  ცვლადის მნიშვნელობის განახლება ნიშნავს იმას, რომ უკვე არსებულ ცვლადს ახალი მნიშვნელობა მივანიჭოთ.


# 2
ასაკი=12
print(ასაკი)



# 3
name="saba"
age=12
height=1.50

print(name,age,height)

# 4
ricxvi=3
ricxui=7
print(7+3)

#5
gak="level 2"
gak="level 3"
print(gak)
