# 1) ახსენით რა არის კონკატინაცია

# 2)დაპრინტე ყველა მონაცემთა ტიპის ერთი მაგალითი

# 3)რას გამოიტანს კოდი "10" + "23"

# 4)მომხმარებელს შემოატანინე რიცხვი და დაპრინტე ამ რიცხვს დამატებული 10

# 5)გადააკეთე ეს კოდი ისე რომ მიიღო 25 (არ დაწერო 20+5):

# print("20" + "5")

# 6)მომხმარებელს შემოატანინე თავისი სახელი, შემდეგ შემოატანინეთ თავისი გვარი და დაბეჭდეთ ორივე ერთად

# 7)მომხმარებელს ორი რიცხვი და დაბეჭდეთ ამ რიცხვების ნამრავლი

# დავალება 1
#  კონკატინაცია ნიშნავს ორი ან მეტი სტრინგის (ტექსტის) ერთმანეთზე მიმატებას. 


# დავალება 2
#  string
text = "Hello"

# int
number = 42

# float
pi = 3.14


# დავალება 3
# კოდი გამოიტანს 1023 ს


# დავალება 4
რიცხვი=(input("შეიყვანე რიცხვი: "))
print(რიცხვი+ 10)


# დავალება 5
print(int("20") + int("5"))

# დავალება 6
name = input("შეიყვანე შენი სახელი: ")
surname = input("შეიყვანე შენი გვარი: ")
print(name +  surname)

# დავალება 7
num1 = (input("შეიყვანე პირველი რიცხვი: "))
num2 = (input("შეიყვანე მეორე რიცხვი: "))
print( num1 * num2)


