# 1)კომენტარის სახით ახსენით სხვაობა ერთგვერდიან ვებსაიტსა და მრავალგვერდიან ვებსაიტს შორის

# 2)კომენტარის სახით ახსენით რა არის ნავიგაციის მენიუ და რაში გამოიყენება ის (ასევე მოიყვანეთ მაგალითი ცნობილი ვებსაიტებიდან)  -(შეგიძლიათ დასქრინოთ)

# 3)შექმენით საიტი აკადემიის შესახებ სადაც გექნებათ 3 გვერდი (HOME გვერდზე უნდა გქონდეთ აკადემიის შესახებ შესავალი) 
#  (ABOUT გვერდზე უნდა გეწეროთ დეტალური ინფორმაცია აკადემიის შესახებ, მაგალითად კურსები, მათი ფასები, მოსწავლეების 
# რაოდენობა და ასე შემდეგ) (CONTACT გვერდზე უნდა გქონდეთ აკადემიის საკონტაქტო ინფორმაცია, მაგ: facebook, youtube, email და ასე შემდეგ) 
# (სურვილისამებრ შეგიძლიათ დაამატოთ სხვა გვერდებიც) (გამოიყენეთ აუცილებლად ნავიგაციის მენიუ)



