# 1)ახსენით რაარის კომენტარი
# 2)კომენტარების სახით ახსენით რასაკეთებს და რაარის print()
# 3)გააკეთეთ ყველა იმ მათემატიკურ ოპერაციაზე რაც იცით ორ ორი მაგალითი და შემდგომ შედეგი დაბეჭდეთ ტერმინალში
# 4)ტერმინალში დაბეჭდეთ თქვენი სახელი გვარი ასაკი და საცხოვრებელი ადგილი
# 5) დაბეჭდეთ თქვენთვის 5 ყველაზე საუკეთესო ფილმი

#1  კომენტარი არის ის  რომლის დახმარებითაც ჩვენ შეგვეძლება დავწეროთ ყველაფერი მაგრამ პითონი მას არ წაიკითხავს.
#2  print() მას გამოაქვს (ბჭდავს). (რასაც მის ფრჩხილებში ჩავწერთ)

#3
print(20*6)
print(10*2)
print(2+4)
print(8+23)
print(200/2)
print(64/4)

#4
print("saba sisvadze")
print("muxiani")
print(12)

#5
print("bad boys")
print("bad boys 2")
print("bad boys 3")
print("karate kid")
print("legends")