# 1)კომენტარის სახით ახსენი რა არის ალგორითმი (მოიყვანე 3 რეალური ცხოვრების მაგალითი)

# 2)კომენტარის სახით ახსენი რა არის control flow (ჩამოწერე და დეტალურად ახსენი კოდის გაშვების რა გზები ვისწავლეთ)

# 3)კომენტარის სახით ჩამოწერე თითოეული ალგორითმის გამოსახვის გზები და ახსენი ისინი




# davaleba 1
# ალგორითმი არის კონკრეტული დავალების შესრულება თანმიმდევრულად გაწერილი ნაბიჯების მიხედვით.

# დავალება 2
# Control Flow  განსაზღვრავს როგორ შესრულდება ინსტრუქციები, რა თანმიმდევრობით და რა პირობებში.
# ვისწავლეთ:
# seguencing-ზევიდან ქვევით გაშვება
# interation-კოდის გამეორება რამდენჯერაც გვინა
# selection-როდესაც გაშვებისას რაიმე ვარიანტი არსებობს


# დავალება 3

# pseudocode-პროგრამირების ენას დამატებული ჩვეულებრივი ენა
# flowchart- ფოტოს საშუალებით
# natural language-ჩვეულებრივი ენით






# 1)for ციკლით გამოიტანე რიცხვები 1-დან 25-მდე

# 2)გამოიტანე რიცხვები 2-დან 46-ის ჩათვლით ყველა ლუწი რიცხვი

# 3)დაბეჭდეთ თქვენი სახელი 100-ჯერ

# 4)მომხმარებელს შემოატანინე ორი რიცხვი და გამოიტანე ყველა ის რიცხვი რომელიც მათ შორისაა



# დავალება1

for i in range(25):
  print(i)

# დავალება 2

for i in range(2,46,2):
    print(i)


# დავალება 3

for i in range(100):
    print("saba")

# დავალება 4

a = int(input(" პირველი რიცხი: "))
b = int(input(" მეორე რიცხვი: "))

for i in range(a , b):
    print(i)




