# 1)კომენტარის სახით ახსენი რა არის implicit და explicit მნიშვნელობის შეცვლა

# 2) მომხმარებელს შემოატანინე თავისი ასაკი და დაუპრინტე რამდენი წლის იქნება 10 წელში

# # 3)რას გამოიტანს კოდი:
# # a = 5
# # print(a//2)

# # print(False - int(str(True + 1) * 2) + True + int(float("5")))




# # დავალება 1

# #  Implicit ნისნავს მნიშვნელობის შეცვლა ეს ხდება ავტომატურად, როცა კომპილატორი თვითონ ახდენს ტიპის გარდაქმნას, პროგრამისტის ჩარევის გარეშე.


# # Explicit ნიშნავს მნიშვნელობის შეცვლა ეს არის მაშინ, როცა პროგრამისტი პირდაპირ მიუთითებს გარდაქმნას.



# # დავალება 2

წელი = int(input(" შეიყვანე შენი ასაკი- "))
მომავალი = წელი + 10
print("10 წელში შენ იქნები", მომავალი, "წლის.")

# # დავალება 3

# a = 5
# print(a//2)

# # გამოთვლა
# # (False - int(str(True + 1) * 2) + True + int(float("5")))

# # პასუხი იქნება 2 რადგან:

# # იწყება შუიდან ტრუ ტოლია 1, ესეიგი 1+1=2
# # სტრინგი გადააქცევს სტრინგად მაგრამ ინტეგერი დააბრუნებს და იქნება ისევ 2
# # შემდეგ გამრავლდება და გახდება 4 
# # შემდეგ ფოლსი =0 ესეიგი 0-4=-4
# # შემდეგ დაემატება 1 გახდება -3 
# # შემდეგ ფრჩხილში ფლოატი გადააქცევს 5.0 მაგრამ ინტეგერი გადააქცევს ისევ 5 ხოლო -3+5=2


print(False - int(str(True + 1) * 2) + True + int(float("5")))














# 1)კომენტარის სახით ახსენით რა არის განსხვავება and და or ოპერატორებს შორის

# 2)გამოიტანე შედარების ოპერატორების და ლოგიკური ოპერატორების 2-2 მაგალითი

# 3)რას გამოიტანს კოდი print(3>1 or False)

# 4)რას გამოიტანს კოდი

# num = 7//2
# print(num == 3 and 5>2)

# 5)რომელი ლოგიკური ოპერატორი ჩავსვათ რომ მივიღოთ False

# random = 2*3

# print(random > 5   ___   False)


# 1)კომენტარის სახით ახსენით რა არის განსხვავება and და or ოპერატორებს შორის

# 2)გამოიტანე შედარების ოპერატორების და ლოგიკური ოპერატორების 2-2 მაგალითი

# 3)რას გამოიტანს კოდი print(3>1 or False)

# 4)რას გამოიტანს კოდი

# num = 7//2
# print(num == 3 and 5>2)

# 5)რომელი ლოგიკური ოპერატორი ჩავსვათ რომ მივიღოთ False

# random = 2*3

# print(random > 5   ___   False)


# davaleba 1

# end და or ოპერატორებს შორის ის განსხვავებაა რომ ერთი ნიშნავს და დამეორე ან თუ end გვაქ რაიმე მოცემულ ორივე პირობას 
# უნდა აკმაყოფილებდეს მაგრან თუ or გვაქ მაშინ ერთ ერთს მაინც


# davaleba 2
print(3>2)     
print(23>12)
print(4<5)
print(2<5)
print(34>=34)
print(13>=12)
print(23<=45)
print(78<=78)
# davaleba 3

# გამოიტანს true
 
# davaleba 4

# გამოიტანს false 


# davaleba 5

# end ოპერატორი