# 1)კომენტარის სახით ახსენი რა არის implicit და explicit მნიშვნელობის შეცვლა

# 2) მომხმარებელს შემოატანინე თავისი ასაკი და დაუპრინტე რამდენი წლის იქნება 10 წელში

# # 3)რას გამოიტანს კოდი:
# # a = 5
# # print(a//2)

# # print(False - int(str(True + 1) * 2) + True + int(float("5")))




# # დავალება 1

# #  Implicit ნისნავს მნიშვნელობის შეცვლა ეს ხდება ავტომატურად, როცა კომპილატორი თვითონ ახდენს ტიპის გარდაქმნას, პროგრამისტის ჩარევის გარეშე.


# # Explicit ნიშნავს მნიშვნელობის შეცვლა ეს არის მაშინ, როცა პროგრამისტი პირდაპირ მიუთითებს გარდაქმნას.



# # დავალება 2

# წელი = int(input(" შეიყვანე შენი ასაკი- "))
# მომავალი = წელი + 10
# print("10 წელში შენ იქნები", მომავალი, "წლის.")

# # დავალება 3

# a = 5
# print(a//2)

# # გამოთვლა
# # (False - int(str(True + 1) * 2) + True + int(float("5")))

# # პასუხი იქნება 2 რადგან:

# # იწყება შუიდან ტრუ ტოლია 1, ესეიგი 1+1=2
# # სტრინგი გადააქცევს სტრინგად მაგრამ ინტეგერი დააბრუნებს და იქნება ისევ 2
# # შემდეგ გამრავლდება და გახდება 4 
# # შემდეგ ფოლსი =0 ესეიგი 0-4=-4
# # შემდეგ დაემატება 1 გახდება -3 
# # შემდეგ ფრჩხილში ფლოატი გადააქცევს 5.0 მაგრამ ინტეგერი გადააქცევს ისევ 5 ხოლო -3+5=2


print(False - int(str(True + 1) * 2) + True + int(float("5")))