# 1) ახსენით რა არის input და output

# 2) მომხმარებელს შემოატანინე სახელი და გამოიტანე

# 3)რას გამოიტანს კოდი print(int("24") + 23)

# 4)შექმენი ორი ცვლადი სადაც შეინახავ შენს სახელსა და გვარს, შემდეგ კი კონკატინაციის საშუალებით დაპრინტე ისინი ერთად

# 5)გადახედეთ ჩანაწერს და ჩაასწორეთ საკლასოები

# დავალება 1

# Input — ეს არის მონაცემი, რომელსაც პროგრამა იღებს მომხმარებლისგან ან სხვა წყაროდან 
# Output — ეს არის შედეგი, რომელსაც პროგრამა აბრუნებს ან აჩვენებს მომხმარებელს 

# დავალება 2
name = input("შეიყვანეთ თქვენი სახელი: ")
print("თქვენი სახელი არის:", name)

# დავალება 3
print(int("24") + 23)

# დავალება 4
name = "საბა"
surname = "სისვადძე"
print(name + " " + surname)
